# Decision tree

Problem statement : An HR department of a company wants to create an automatic system that can predict an ideal salary for a candidate.

# Importing the Dependencies

In [1]:
import pandas as pd
from sklearn import tree
from sklearn.preprocessing import LabelEncoder

# Data Collection & Pre-Processing

In [3]:
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [4]:
inputs = df.drop('salary_more_then_100k',axis='columns') #independent variable is named input

In [5]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [6]:
target = df['salary_more_then_100k'] #dependent variable is named target

In [7]:
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [ ]:
#machine learning algo works on numbers they dont understand labels so we need to convert the three columns(job company and degree) into numbers.
#it can be done label encoder

In [8]:

le_company = LabelEncoder() #creating 3 objects of label encoder
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [ ]:
#in the below cell a new column named 'company_n' is added to the df by this " inputs['company_n'] = .. " and  fit and transform method is called.
#so basically google is assigned number 2 fb 0 abc pharma 1 and so on.

In [9]:
inputs['company_n'] = le_company.fit_transform(inputs['company']) 
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [10]:
inputs

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [11]:
inputs_n = inputs.drop(['company','job','degree'],axis='columns') #creating new df inputs_n

In [12]:
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

# Model training

In [13]:
model = tree.DecisionTreeClassifier()

In [14]:
model.fit(inputs_n, target) #training the model

DecisionTreeClassifier()

# Model Evaluation

In [15]:
model.score(inputs_n,target)

1.0

# Final Prediction

In [16]:
##Is salary of Google, Computer Engineer, Bachelors degree > 100 k ?

In [17]:
model.predict([[2,1,0]])

d:\python2022\machine_learning_cwh\ml\venv\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [18]:
#array([0], dtype=int64) "0" means no his salary wont be more than 120 k

In [19]:
##Is salary of Google, Computer Engineer, Masters degree > 100 k ?

In [20]:
model.predict([[2,1,1]])

d:\python2022\machine_learning_cwh\ml\venv\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)